XiuruiFu/STC_B-STC15F2K60S2-spacewar/source/main.c
    /* P1 护盾: 温度 > 阈值时激活 (读本板 Rt) */
    g_shield1 = (calc_temp(GetADC().Rt) > SHIELD_TEMP) ? 1 : 0;

    /* 菜单态: P2 菜单导航 + 确认 (边沿触发) */
    if (g_state == ST_MENU) {
        if ((p2_keys & K_MENUUP) && !(p2_keys_prev & K_MENUUP)) menu_move(-1);
        if ((p2_keys & K_MENUDOWN) && !(p2_keys_prev & K_MENUDOWN)) menu_move(+1);
        if ((p2_keys & K_FIRE) && !(p2_keys_prev & K_FIRE)) menu_confirm();
    }

    if (g_state == ST_PLAYING) {
        /* P1 开火边沿 */
        if (p1_fire_edge) {
            p1_fire_edge = 0;
            try_fire(&ship1, bullet1);
        }
        /* P2 开火边沿 */
        if ((p2_keys & K_FIRE) && !(p2_keys_prev & K_FIRE)) {
            SetBeep(900, 4);   /* P2 开火音效(由主机统一发声) */
            try_fire(&ship2, bullet2);
        }

        update_ship(&ship1, p1_keys);
        update_ship(&ship2, p2_keys);
        update_bullets(bullet1);
        update_bullets(bullet2);
        /* 合作战: BOSS 射击 + BOSS 子弹积分 */
        if (g_easterEgg) {
            if (g_bossAlive && g_bossFireTick > 0) {
                g_bossFireTick--;
                if (g_bossFireTick == 0) {
                    boss_fire();
                    g_bossFireTick = BOSS_FIRE_INTERVAL;
                }
            }
            update_boss_bullets();
        }
        check_collisions();
        check_winner();
    }
    else if (g_state == ST_GAMEOVER) {
        if (gameover_tick > 0) {
            gameover_tick--;
            if (gameover_tick == 0) {
                g_state = ST_MENU;
                g_flags = 0;
            }
        }
    }
    else if (g_state == ST_EXITED) {
        if (exit_tick > 0) {
            exit_tick--;
            if (exit_tick == 0) g_state = ST_MENU;
        }
    }

    p2_keys_prev = p2_keys;

    send_frame();
    display_wins();
}

void cb_key(void) {
    unsigned char k;
    k = GetKeyAct(enumKey1);
    if (k == enumKeyPress) p1_keys |= K_BACK;
    else if (k == enumKeyRelease) p1_keys &= ~K_BACK;

    k = GetKeyAct(enumKey2);
    if (k == enumKeyPress) {
        if (g_state == ST_PLAYING) p1_fire_edge = 1;
        else if (g_state == ST_MENU) menu_confirm();
        else if (g_state == ST_EXITED) g_state = ST_MENU;
        SetBeep(900, 4);
    }
}

void cb_nav(void) {
    unsigned char k;
    /* Key3(前进) 与导航键 K3 共用 P1.7, 只能通过 ADC 读 */
    k = GetAdcNavAct(enumAdcNavKey3);
    if (k == enumKeyPress) p1_keys |= K_FWD;
    else if (k == enumKeyRelease) p1_keys &= ~K_FWD;

    /* 游戏态: 旋转 */
    k = GetAdcNavAct(enumAdcNavKeyDown);
    if (k == enumKeyPress) p1_keys |= K_LEFT;
    else if (k == enumKeyRelease) p1_keys &= ~K_LEFT;

    k = GetAdcNavAct(enumAdcNavKeyUp);
    if (k == enumKeyPress) p1_keys |= K_RIGHT;
    else if (k == enumKeyRelease) p1_keys &= ~K_RIGHT;

    /* 菜单态: 上下选择 */
    if (g_state == ST_MENU) {
        k = GetAdcNavAct(enumAdcNavKeyLeft);
        if (k == enumKeyPress) menu_move(-1);
        k = GetAdcNavAct(enumAdcNavKeyRight);
        if (k == enumKeyPress) menu_move(+1);
    }
}

void cb_uart2(void) {
    unsigned char sum;
    sum = uart2_rx[0] + uart2_rx[1] + uart2_rx[2] + uart2_rx[3];
    if (uart2_rx[4] == sum) {
        p2_keys = uart2_rx[2];
        g_shield2 = (uart2_rx[3] != 0);   /* P2 护盾激活标志(由从机按温度判定) */
        rs485_timeout = 50;  /* 500ms 内视为在线 */
    }
}

void cb_ir(void) {
    /* 收到红外数据包: 校验魔数 -> 武装彩蛋(仅 0->1 转变时蜂鸣提示) */
    if (ir_rx[0] == EASTER_MAGIC) {
        if (g_easterArmed == 0) SetBeep(1600, 15);
        g_easterArmed = 1;
    }
}

void cb_led(void) {
    unsigned char led;
    /* 菜单态且彩蛋已武装: LED 流水灯 (l0->l1->...->l7->l0 循环) */
    if (g_state == ST_MENU && g_easterArmed) {
        if (g_led_run == 0) g_led_run = 1;
        led = g_led_run;
        g_led_run = (g_led_run == 0x80) ? 0 : (g_led_run << 1);
        LedPrint(led);
        return;
    }
    /* 常规: 最高位指示 RS485 在线, 低4位指示当前菜单项(菜单态) */
    led = 0;
    if (rs485_timeout > 0) led |= 0x80;
    if (g_state == ST_MENU) led |= (1 << g_menuSel);
    LedPrint(led);
}

/* ================= 初始化 NVM ================= */
void init_nvm(void) {
    struct_DS1302_RTC t;
    t.second = 0; t.minute = 0; t.hour = 0;
    t.day = 1; t.month = 1; t.week = 1; t.year = 24;
    DS1302Init(t);
    if (NVM_Read(2) != 0x5A) {
        NVM_Write(0, 0);
        NVM_Write(1, 0);
        NVM_Write(2, 0x5A);
        p1wins = 0; p2wins = 0;
    } else {
        p1wins = NVM_Read(0);
        p2wins = NVM_Read(1);
    }
}

/* ================= 主程序 ================= */
void main(void) {
    DisplayerInit();
    KeyInit();
    AdcInit(ADCexpEXT);
    BeepInit();
    Uart1Init(115200);
    Uart2Init(38400, Uart2Usedfor485);
    SetUart2Rxd(uart2_rx, 5, slv_head, 2);
    IrInit(NEC_R05d);
    SetIrRxd(ir_rx, 1);

    init_nvm();

    g_state = ST_MENU;
    g_menuSel = 0;
    p1_keys = 0; p2_keys = 0; p2_keys_prev = 0;
    p1_fire_edge = 0;
    g_flags = 0;
    g_bgMode = BG_NIGHT;
    g_easterArmed = 0;
    g_easterEgg = 0;
    g_bossHp = BOSS_HP;
    g_bossAlive = 0;
    g_bossFireTick = 0;
    g_bossFireAng = 0;
    g_shield1 = 0;
    g_shield2 = 0;
    g_led_run = 0;
    gameover_tick = 0;
    exit_tick = 0;
    rs485_timeout = 0;
    rnd_seed = 0x1234;
    ship1.active = 0; ship2.active = 0;
    clear_bullets(bullet1);
    clear_bullets(bullet2);
    clear_boss_bullets();
    SetDisplayerArea(0, 7);
    Seg7Print(10, 10, 10, 10, 10, 10, 10, 10);
    LedPrint(0);

    SetEventCallBack(enumEventSys10mS, cb_10ms);
    SetEventCallBack(enumEventKey, cb_key);
    SetEventCallBack(enumEventNav, cb_nav);
    SetEventCallBack(enumEventUart2Rxd, cb_uart2);
    SetEventCallBack(enumEventIrRxd, cb_ir);
    SetEventCallBack(enumEventSys100mS, cb_led);

    MySTC_Init();

    while (1) {
        MySTC_OS();
    }
}
